
// 16.项目：cache 设计

// 二、面试第 2 轮
// 1. 那些问题对你挑战最大？
// 2. JDK 1.8 ConcurrentHashMap 做过什么改进？HashMap 死锁？
// 3. 标记的时候怎么找出栈上的 GC Root？说出一种可能的方案，存在什么问题？
// 5. 本地缓存怎么优化空间？（提出 BitMap）BitMap 可行吗？怎么验证可行性？如果不可行，怎么证伪？
// 坏处？
//
// 12. 平衡二叉树13. 业务逻辑
// 14. MySQL
// 15. 服务设计题
// 16. web 架构设计
// 17. Pack
// 18. http 协议
// 19. 爬虫
// 20. Java Agent
// 21. Zookeeper
// 22. LoadBalance
// 23. 分布式 ID
// 24. Nginx
// 25. Cookie
// 26. Session
// 27. GC
// 28. 手写 LRU 缓存
// 29. 将现有线性存储结构改成环形结构
// 34. 线程池，核心参数，扩容原理，使用注意点
// 35. 数据库主从同步，延迟
// 36. 数据库和缓存一致性问题，出现的场景，解决方案
// 38. 一致性哈希算法
// 40. 服务提供方不稳定，频繁变动如何提升自身稳定性
